RT-Thread/rt-thread/bsp/stm32/libraries/STM32WLxx_HAL/STM32WLxx_HAL_Driver/Src/stm32wlxx_hal_flash_ex.c
  return status;
}

#if defined(DUAL_CORE)
/**
  * @brief Update the security bit in a FLASH register.
  * @param SecureMode Parameter to check as disabled or enabled
  * @param Reg FLASH register to update
  * @param Bit Bit in FLASH register to update
  * @param ValueEnable Constant to check in comparison with SecureMode as enabled
  * @retval None
  */
static void FLASH_OB_ConfigSecureMode(uint32_t SecureMode, uint32_t *Reg, uint32_t Bit, uint32_t ValueEnable)
{
  /* Check if SecureMode is requested */
  if ((SecureMode & ValueEnable) == ValueEnable)
  {
    CLEAR_BIT(*Reg, Bit);
  }
  else
  {
    SET_BIT(*Reg, Bit);
  }
}

/**
  * @brief Get the security bit in a FLASH register.
  * @param Reg FLASH register to check
  * @param Bit Bit in FLASH register to check
  * @param ValueEnable Constant to check in comparison with SecureMode as enabled
  * @param ValueDisable Constant to check in comparison with SecureMode as disabled
  * @retval SecureMode Specifies the Secure area enabled or disabled.
  *                               This return value can be one of the following values:
  *                               ValueEnable
  *                               ValueDisable
  *                               Null
  */
static uint32_t FLASH_OB_GetSecureMode(uint32_t Reg, uint32_t Bit, uint32_t ValueEnable, uint32_t ValueDisable)
{
  /* Return status of bit (set as enable, set as disable) */
  if (READ_BIT(Reg, Bit) == 0U)
  {
    return ValueEnable;
  }
  else
  {
    return ValueDisable;
  }
}
#endif /* DUAL_CORE */

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_FLASH_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
